{
    "Header": {
        "aboutLabel": "About",
        "homeLabel": "Home",
        "logoLabel": "Philippe Duval",
        "projectsLabel": "Projects"
    },
    "Home": {
        "description": "Turning concepts <br /> into a code-driven reality.",
        "greeting": "Hi,",
        "id": "home",
        "userName": "Philippe",
        "userPronoun": "I'm "
    },
    "About": {
        "id": "about",
        "title": "About me",
        "subtitle": "Bonjour !",
        "firstParagraph": "My name is Philippe, a 28-year-old web developer hailing from the beautiful coastal town of Brest, France.",
        "secondParagraph": "I'm passionate about enhancing user interfaces and crafting intuitive design systems that make digital experiences come to life. I'm an ardent believer in the power of continuous learning and the art of effective communication, values I hold dear in both my personal and professional journey.",
        "thirdParagraph": "Beyond the screen, you'll find me pedaling through scenic routes or hitting the gym, feeding my love for fitness. I'm also an avid traveler, with an upcoming adventure to South Korea awaiting, where I can't wait to explore new horizons and immerse myself in the vibrant culture."
    },
    "Projects": {
        "AsuraGate": {
            "description": "This project started from the need to have as a video-game tournament organizer, a platform where I could easily manage the events : manage the registration process, submit the results and calculate the scoring automatically. After designing wireframes on Figma and determining the database schema and triggers, I moved onto making the system which was then used in those events. Moving forward, plans are to extend this back-end application with a front-end that would allow a player to view a list of events and have a global vision of what is happening in those.",
            "href": "https://github.com/ichiin/tournament-randomizer",
            "tags": "Figma,React,TypeScript,Vite,Emotion,Nodejs,mariaDB,SQL",
            "title": "Asura Gate"
        },
        "CryptoManager": {
            "description": "This project is part of series of apps I made to learn about a few Web3 JS libraries. After deploying a smart contract on a testnet, I was able to use a simple web interface to manage a newly created token ! I was then able to transfer tokens from wallet to wallet or to burn them as my own liking.",
            "href": "https://github.com/ichiin/bloodhuntCoin-manager",
            "tags": "React,CRA,ethers.js",
            "title": "Crypto currency manager - HNT token"
        },
        "Gotchat": {
            "description": "My first freelancing project, I worked on an account aggregator application for social media platforms. The objective of the application was to allow a user to be able to log onto multiple accounts through one connection and efficiently swap between accounts. Another requirement was a shared data pool as, the user could access pictures, chats or videos from all of its account to re-use them easily",
            "tags": "Figma,React,CRA,Tailwind,Firebase",
            "title": "Gotchat"
        },
        "PersonalWebsite": {
            "description": "My latest project, I wanted to have a space out there where I could showcase my work and the latest ideas I'm working on. I started building the interface using Figma, determing the color palette and the general scheme I wanted to build. Afterwards, I moved to the editor to build the finished product you are watching now.",
            "href": "https://github.com/ichiin/portfolio-site",
            "tags": "Figma,React,TypeScript,Vite,Emotion",
            "title": "Personal website"
        },
        "id": "projects",
        "title": "Projects"
    },
    "Footer": {
        "id": "footer",
        "love": "Made with ❤ @ Brest",
        "mail": "home@philippeduval.dev",
        "user": "Philippe Duval"
    }
}