{
    "Header": {
        "aboutLabel": "À propos",
        "homeLabel": "Accueil",
        "logoLabel": "Philippe Duval",
        "projectsLabel": "Projets"
    },
    "Home": {
        "description": "Transformer les idées <br /> en réalité à travers le code.",
        "greeting": "Salut,",
        "userName": "Philippe",
        "userPronoun": "Moi c'est "
    },
    "About": {
        "id": "about",
        "title": "À propos",
        "subtitle": "Bonjour !",
        "firstParagraph": "Je m'appelle Philippe, un développeur web de 28 ans originaire de la belle ville côtière de Brest.",
        "secondParagraph": "Je suis passionné par l'amélioration des interfaces utilisateur et la création de systèmes de conception intuitifs qui donnent vie aux expériences numériques. Je crois fermement au pouvoir de l'apprentissage continu et à l'art de la communication efficace, des valeurs qui me sont chères tant dans ma vie personnelle que professionnelle.",
        "thirdParagraph": "Hors de l'écran, vous me trouverez en train de pédaler dans l'univers de Zwift ou bien en train de m'entraîner à la salle de sport. J'aime également beaucoup voyager. Prochain arrêt prévu... la Corée du Sud ! J'ai hâte d'explorer de nouveaux horizons, de découvrir un nouveau pays et une nouvelle culture."
    },
    "Projects": {
        "AsuraGate": {
            "description": "Ce projet a débuté du besoin en tant qu'organisateur de tournois de jeux vidéo, d'une plateforme où je pouvais facilement gérer les événements : gérer le processus d'inscription, soumettre les résultats et calculer automatiquement le score. Après avoir conçu des wireframes sur Figma et déterminé le schéma de la base de données et les déclencheurs, je suis passé à la création du système, qui a ensuite été utilisé lors de ces événements. À l'avenir, les plans sont d'étendre cette application backend avec une interface frontend qui permettrait à un joueur de consulter une liste d'événements et d'avoir une vision globale de ce qui se passe dans ceux-ci.",
            "href": "https://github.com/ichiin/tournament-randomizer",
            "tags": "Figma,React,TypeScript,Vite,Emotion, Nodejs,mariaDB,SQL",
            "title": "Asura Gate"
        },
        "CryptoManager": {
            "description": "Ce projet fait partie d'une série d'applications que j'ai créées pour apprendre à utiliser quelques bibliothèques Web3 JS. Après avoir déployé un contrat intelligent sur un testnet, j'ai pu utiliser une interface web simple pour gérer un jeton nouvellement créé ! J'ai ensuite pu transférer des jetons d'un portefeuille à un autre ou les brûler selon mes préférences.",
            "href": "https://github.com/ichiin/bloodhuntCoin-manager",
            "tags": "React,CRA,ethers.js",
            "title": "Gestionnaire de crypto-monnaie - jeton HNT"
        },
        "Gotchat": {
            "description": "Mon premier projet en freelance, j'ai travaillé sur une application d'agrégation de comptes pour les plateformes de médias sociaux. L'objectif de l'application était de permettre à un utilisateur de se connecter à plusieurs comptes via une seule connexion et de passer efficacement d'un compte à l'autre. Une autre exigence était un pool de données partagées, car l'utilisateur pouvait accéder aux images, aux discussions ou aux vidéos de tous ses comptes pour les réutiliser facilement.",
            "tags": "Figma,React,CRA,Tailwind,Firebase",
            "title": "Gotchat"
        },
        "PersonalWebsite": {
            "description": "Mon dernier projet, je voulais avoir un espace où je pourrais présenter mon travail et les dernières idées sur lesquelles je travaille. J'ai commencé à construire l'interface à l'aide de Figma, en déterminant la palette de couleurs et le schéma général que je voulais créer. Ensuite, je suis passé à l'éditeur pour créer le produit final que vous êtes en train de regarder maintenant.",
            "href": "https://github.com/ichiin/portfolio-site",
            "tags": "Figma,React,TypeScript,Vite,Emotion",
            "title": "Site personnel"
        },
        "id": "projects",
        "title": "Projets"
    },
    "Footer": {
        "love": "Fait avec ❤ @ Brest",
        "mail": "home@philippeduval.dev",
        "user": "Philippe Duval"
    }
}
